{
  "backend/main.mo": "Defines itinerary types and generates mock itineraries with day plans, food spots, and transport, returning formatted text.",
  "feature_evidence.json": "Records evidence for a frontend feature update related to Recommended Transport text and identifies affected file and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend files describing their purpose and behavior.",
  "frontend/index.css": "Defines global Tailwind-based Goa-themed color variables and light/dark mode styling.",
  "frontend/index.html": "HTML entry point with Goa Car Rental title and root div loading main React script.",
  "frontend/src/App.tsx": "Renders the LandingPage component as the app’s root UI.",
  "frontend/src/components/GoaPlanner/ItineraryResults.tsx": "Parses itinerary text into sections and displays days, hotels, food spots, and transport with styled cards and icons.",
  "frontend/src/components/GoaPlanner/LandingPage.tsx": "Hosts header, trip form, and results using local mock itinerary generation with Goa Car Rental branding.",
  "frontend/src/components/GoaPlanner/TripPlanningForm.tsx": "Form UI to select duration, budget, travel type, and location, triggering itinerary generation.",
  "frontend/src/constants/whatsapp.ts": "Exports a WhatsApp contact URL with a preset Goa rental inquiry message.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, and identity persistence. Wraps AuthClient setup with custom idle behavior.",
  "frontend/src/hooks/useMockPlanTrip.ts": "Defines a React Query mutation that simulates trip planning using local mock data, adding an artificial delay before returning a generated plan.",
  "frontend/src/hooks/usePlanTrip.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines a Goa-themed color system with light/dark variants and utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and renders the root App component.",
  "frontend/src/mock/advancedLocalDatasets.ts": "Contains 5-day Goa itinerary data and budget-specific hotel, food, and transport datasets used for mock trip planning.",
  "frontend/src/mock/generatePlan.ts": "Generates a text-based itinerary by slicing day plans based on duration and appending budget-specific recommendations.",
  "frontend/src/mock/sampleItinerary.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind config extending theme with custom Goa color tokens, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and known issues for the Goa Car Rental UI and mock itinerary system."
}